#### Terraform Plan 📋 `prod/kubernetes`

**Summary:** 09:27:41.694 STDOUT terraform: Plan: 2 to add, 0 to change, 0 to destroy.

<details><summary>Show Plan Details</summary>

```terraform
09:27:41.692 STDOUT terraform:   + create
09:27:41.692 STDOUT terraform: Terraform will perform the following actions:
09:27:41.692 STDOUT terraform:   # digitalocean_kubernetes_cluster.k8s will be created
09:27:41.692 STDOUT terraform:   + resource "digitalocean_kubernetes_cluster" "k8s" {
09:27:41.692 STDOUT terraform:       + auto_upgrade                     = true
09:27:41.692 STDOUT terraform:       + cluster_subnet                   = (known after apply)
09:27:41.692 STDOUT terraform:       + created_at                       = (known after apply)
09:27:41.692 STDOUT terraform:       + destroy_all_associated_resources = false
09:27:41.692 STDOUT terraform:       + endpoint                         = (known after apply)
09:27:41.692 STDOUT terraform:       + ha                               = false
09:27:41.692 STDOUT terraform:       + id                               = (known after apply)
09:27:41.692 STDOUT terraform:       + ipv4_address                     = (known after apply)
09:27:41.692 STDOUT terraform:       + kube_config                      = (sensitive value)
09:27:41.692 STDOUT terraform:       + name                             = "prod-cluster"
09:27:41.692 STDOUT terraform:       + region                           = "fra1"
09:27:41.693 STDOUT terraform:       + registry_integration             = false
09:27:41.693 STDOUT terraform:       + service_subnet                   = (known after apply)
09:27:41.693 STDOUT terraform:       + status                           = (known after apply)
09:27:41.693 STDOUT terraform:       + surge_upgrade                    = true
09:27:41.693 STDOUT terraform:       + updated_at                       = (known after apply)
09:27:41.693 STDOUT terraform:       + urn                              = (known after apply)
09:27:41.693 STDOUT terraform:       + version                          = "1.34.0-do.0"
09:27:41.693 STDOUT terraform:       + vpc_uuid                         = "dea2552a-4a3c-4a0c-9755-4ccb5e07aafe"
09:27:41.693 STDOUT terraform:       + amd_gpu_device_metrics_exporter_plugin (known after apply)
09:27:41.693 STDOUT terraform:       + amd_gpu_device_plugin (known after apply)
09:27:41.693 STDOUT terraform:       + control_plane_firewall (known after apply)
09:27:41.693 STDOUT terraform:       + maintenance_policy {
09:27:41.693 STDOUT terraform:           + day        = "saturday"
09:27:41.693 STDOUT terraform:           + duration   = (known after apply)
09:27:41.693 STDOUT terraform:           + start_time = "03:00"
09:27:41.693 STDOUT terraform:         }
09:27:41.693 STDOUT terraform:       + node_pool {
09:27:41.693 STDOUT terraform:           + actual_node_count = (known after apply)
09:27:41.693 STDOUT terraform:           + auto_scale        = true
09:27:41.693 STDOUT terraform:           + id                = (known after apply)
09:27:41.693 STDOUT terraform:           + labels            = {
09:27:41.693 STDOUT terraform:               + "owner"    = "DevOps Team"
09:27:41.693 STDOUT terraform:               + "priority" = "high"
09:27:41.693 STDOUT terraform:               + "service"  = "app"
09:27:41.693 STDOUT terraform:             }
09:27:41.693 STDOUT terraform:           + max_nodes         = 10
09:27:41.693 STDOUT terraform:           + min_nodes         = 3
09:27:41.693 STDOUT terraform:           + name              = "prod-app-pool"
09:27:41.693 STDOUT terraform:           + node_count        = 3
09:27:41.693 STDOUT terraform:           + nodes             = (known after apply)
09:27:41.693 STDOUT terraform:           + size              = "s-2vcpu-8gb"
09:27:41.693 STDOUT terraform:           + tags              = [
09:27:41.693 STDOUT terraform:               + "component:kubernetes",
09:27:41.693 STDOUT terraform:               + "environment:prod",
09:27:41.693 STDOUT terraform:               + "project:my-devops-project",
09:27:41.693 STDOUT terraform:             ]
09:27:41.693 STDOUT terraform:           + taint {
09:27:41.693 STDOUT terraform:               + effect = "NoSchedule"
09:27:41.693 STDOUT terraform:               + key    = "service"
09:27:41.693 STDOUT terraform:               + value  = "app"
09:27:41.693 STDOUT terraform:             }
09:27:41.693 STDOUT terraform:         }
09:27:41.693 STDOUT terraform:       + routing_agent (known after apply)
09:27:41.693 STDOUT terraform:     }
09:27:41.693 STDOUT terraform:   # digitalocean_kubernetes_node_pool.monitoring will be created
09:27:41.693 STDOUT terraform:   + resource "digitalocean_kubernetes_node_pool" "monitoring" {
09:27:41.693 STDOUT terraform:       + actual_node_count = (known after apply)
09:27:41.693 STDOUT terraform:       + auto_scale        = false
09:27:41.693 STDOUT terraform:       + cluster_id        = (known after apply)
09:27:41.693 STDOUT terraform:       + id                = (known after apply)
09:27:41.693 STDOUT terraform:       + labels            = {
09:27:41.693 STDOUT terraform:           + "owner"    = "DevOps Team"
09:27:41.693 STDOUT terraform:           + "priority" = "low"
09:27:41.693 STDOUT terraform:           + "service"  = "monitoring"
09:27:41.693 STDOUT terraform:         }
09:27:41.693 STDOUT terraform:       + max_nodes         = 2
09:27:41.693 STDOUT terraform:       + min_nodes         = 1
09:27:41.693 STDOUT terraform:       + name              = "prod-monitoring-pool"
09:27:41.693 STDOUT terraform:       + node_count        = 1
09:27:41.693 STDOUT terraform:       + nodes             = (known after apply)
09:27:41.693 STDOUT terraform:       + size              = "s-2vcpu-2gb"
09:27:41.693 STDOUT terraform:       + tags              = [
09:27:41.694 STDOUT terraform:           + "component:kubernetes",
09:27:41.694 STDOUT terraform:           + "environment:prod",
09:27:41.694 STDOUT terraform:           + "project:my-devops-project",
09:27:41.694 STDOUT terraform:         ]
09:27:41.694 STDOUT terraform:       + taint {
09:27:41.694 STDOUT terraform:           + effect = "NoSchedule"
09:27:41.694 STDOUT terraform:           + key    = "service"
09:27:41.694 STDOUT terraform:           + value  = "monitoring"
09:27:41.694 STDOUT terraform:         }
09:27:41.694 STDOUT terraform:     }
09:27:41.694 STDOUT terraform: Plan: 2 to add, 0 to change, 0 to destroy.
09:27:41.694 STDOUT terraform: Changes to Outputs:
09:27:41.694 STDOUT terraform:   + app_node_pool_id        = (known after apply)
09:27:41.694 STDOUT terraform:   + cluster_ca_certificate  = (sensitive value)
09:27:41.694 STDOUT terraform:   + cluster_id              = (known after apply)
09:27:41.694 STDOUT terraform:   + cluster_token           = (sensitive value)
09:27:41.694 STDOUT terraform:   + endpoint                = (known after apply)
09:27:41.694 STDOUT terraform:   + kubeconfig              = (sensitive value)
09:27:41.694 STDOUT terraform:   + monitoring_node_pool_id = (known after apply)
09:27:41.842 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
09:27:41.843 STDOUT terraform: Saved the plan to: tfplan
09:27:41.843 STDOUT terraform: To perform exactly these actions, run the following command to apply:
09:27:41.843 STDOUT terraform:     terraform apply "tfplan"
```

</details>

*Pusher: @krukmaksym, Action: `pull_request`, Workflow: `Terraform PR Validation`*